# Pandas Series

In [1]:
import pandas as pd

In [3]:
# Series 
data = [1,2,3,4,5]
myseries = pd.Series(data)
print(myseries)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [57]:
# pd.Series()
# Creating series from dictinaries
# Custom labels when creating series 
# Creating dataframes from dictionary of list(lists as values in dictionary )
# Creating dataframes from a list of dictionaries , List and then inside are dictionaries
# Reading csv using read_csv() 
# Printing the head() , tail() , describe() 
# Accessing the part of data using loc[] and iloc
# Accessing single elements using at and iat
# Adding a new column to a dataframe 
# dropping a column 
# Updating a column
# Dropping a row

In [8]:
labels = ['a','b','c']
data2 = {'a':1,'b':2,'c':3}
series2 = pd.Series(data2)
print(series2)

a    1
b    2
c    3
dtype: int64

In [10]:
data3 = [10,20,30]
index = ['a','b','c']
pd.Series(data3,index=index)

a    10
b    20
c    30
dtype: int64

In [14]:
# Data frame 
data4 = {
    'Name': ['Samad','Ilaf','Aman'],
    'Age': [25,30,45],
    'City': ['Bangalore','New York','Florida']
}

df4 = pd.DataFrame(data4)
print(df4)
print(type(df4))

    Name  Age       City
0  Samad   25  Bangalore
1   Ilaf   30   New York
2   Aman   45    Florida
<class 'pandas.core.frame.DataFrame'>

In [15]:
import numpy as np 
np.array(df4)

array([['Samad', 25, 'Bangalore'],
       ['Ilaf', 30, 'New York'],
       ['Aman', 45, 'Florida']], dtype=object)

In [20]:
# Create a dataframe from a list of dictionaries 

data5 = [
    {'Name':'Samad','Age':25,'City':'Bangalore'},
    {'Name':'Ilaf','Age':30,'City':'New York'},
    {'Name':'Aman','Age':45,'City':'Florida'}
]

df5 = pd.DataFrame(data5)
print(df5)
print(type(df5))

    Name  Age       City
0  Samad   25  Bangalore
1   Ilaf   30   New York
2   Aman   45    Florida
<class 'pandas.core.frame.DataFrame'>

In [22]:
sales_df = pd.read_csv('data.csv')
sales_df.head()

         Date Category  Value   Product  Sales Region
0  2023-01-01        A   28.0  Product1  754.0   East
1  2023-01-02        B   39.0  Product3  110.0  North
2  2023-01-03        C   32.0  Product2  398.0   East
3  2023-01-04        B    8.0  Product1  522.0   East
4  2023-01-05        B   26.0  Product3  869.0  North

In [23]:
sales_df.tail()

          Date Category  Value   Product  Sales Region
45  2023-02-15        B   99.0  Product2  599.0   West
46  2023-02-16        B    6.0  Product1  938.0  South
47  2023-02-17        B   69.0  Product3  143.0   West
48  2023-02-18        C   65.0  Product3  182.0  North
49  2023-02-19        C   11.0  Product3  708.0  North

In [24]:
sales_df.describe()

           Value       Sales
count  47.000000   46.000000
mean   51.744681  557.130435
std    29.050532  274.598584
min     2.000000  108.000000
25%    27.500000  339.000000
50%    54.000000  591.500000
75%    70.000000  767.500000
max    99.000000  992.000000

In [13]:
# Accessing data from data frame 
# Data frame 
data7 = {
    'Name': ['Samad','Ilaf','Aman'],
    'Age': [25,30,45],
    'City': ['Bangalore','New York','Florida']
}

df7 = pd.DataFrame(data7)

# Printing the part of data
df7.loc[0][0]
df7.iloc[1][0]

C:\Users\samad\AppData\Local\Temp\ipykernel_2580\2005330207.py:12: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df7.loc[0][0]
C:\Users\samad\AppData\Local\Temp\ipykernel_2580\2005330207.py:13: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df7.iloc[1][0]

'Ilaf'

In [1]:
import pandas as pd

In [3]:
data = [1,2,3,4,5]
df = pd.Series(data)
print(df)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [ ]:
labels = [11,22,33]
data2 = {'a':1,'b':2,'c':3}

df2 = pd.Series(data2)
print(df2)

11   NaN
22   NaN
33   NaN
dtype: float64

In [9]:
label3 = [11,22,33]
data3 = ['samad','osman','usaid']

df3 = pd.Series(data3,index=label3)
print(df3)

11    samad
22    osman
33    usaid
dtype: object

In [11]:
data4 = {
    'Name': ['Samad','Ilaf','Aman'],
    'Age': [25,30,45],
    'City': ['Bangalore','New York','Florida']
}

df4 = pd.DataFrame(data4)
df4

    Name  Age       City
0  Samad   25  Bangalore
1   Ilaf   30   New York
2   Aman   45    Florida

In [12]:
data5 = [
    {'Name':'Samad','Age':25,'City':'Bangalore'},
    {'Name':'Ilaf','Age':30,'City':'New York'},
    {'Name':'Aman','Age':45,'City':'Florida'}
]

df5 = pd.DataFrame(data5)
df5

    Name  Age       City
0  Samad   25  Bangalore
1   Ilaf   30   New York
2   Aman   45    Florida

In [14]:
df5.loc[0]

Name        Samad
Age            25
City    Bangalore
Name: 0, dtype: object

In [ ]:
df5.loc[2,'City']

'Florida'

In [24]:
df5.loc[1:2]

   Name  Age      City
1  Ilaf   30  New York
2  Aman   45   Florida

In [34]:
df5.loc[[0,2],['Name','City']]

    Name       City
0  Samad  Bangalore
2   Aman    Florida

In [37]:
df5

    Name  Age       City
0  Samad   25  Bangalore
1   Ilaf   30   New York
2   Aman   45    Florida

In [38]:
df5.at[1,'Age']

np.int64(30)

In [51]:
df5.at[2,'City']

'Florida'

In [52]:
df5

    Name  Age       City
0  Samad   25  Bangalore
1   Ilaf   30   New York
2   Aman   45    Florida

In [54]:
# Add a column 
df5['Salary'] = ['50000',60000,70000]
df5

    Name  Age       City Salary
0  Samad   25  Bangalore  50000
1   Ilaf   30   New York  60000
2   Aman   45    Florida  70000

In [55]:
df5.drop('Salary',axis=1,inplace=True)
df5

    Name  Age       City
0  Samad   25  Bangalore
1   Ilaf   30   New York
2   Aman   45    Florida

In [56]:
df5['Age'] = df5['Age']+1
df5

    Name  Age       City
0  Samad   26  Bangalore
1   Ilaf   31   New York
2   Aman   46    Florida